Yr8/8-CS-FruitBots/pages/3_lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>FruitBots</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">FruitBots</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Picking up Fruit on the Way using Arrays</a>
<ul>
<li><a href="#sec-1-1">Learn It</a></li>
<li><a href="#sec-1-2">Learn It</a></li>
<li><a href="#sec-1-3">Learn It</a></li>
<li><a href="#sec-1-4">Learn It</a></li>
<li><a href="#sec-1-5">Document It</a></li>
<li><a href="#sec-1-6">Save It</a></li>
<li><a href="#sec-1-7">Code It</a></li>
<li><a href="#sec-1-8">Run It</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Picking up all the Fruit (in theory)</a>
<ul>
<li><a href="#sec-2-1">Learn It</a></li>
<li><a href="#sec-2-2">Badge It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/MarcScott/8CS-FruitBots">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Picking up Fruit on the Way using Arrays</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>In the last lesson, we moved out FruitBot to a specific square on the board.
</li>
<li>Any position on the board can be described by two numbers; an x coordinate and a y coordinate
</li>
<li>The smallest x and y positions are 0, and the largest are WIDTH - 1 and HEIGHT - 1
</li>
<li>The actual FruitBots program needs to store the position of all the fruits on the board.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>One way of storing data is to use a list. In programming we often use the term <i>array</i>, but the terms <i>list</i> and <i>array</i> are often interchangable.
</li>
<li>A Wednesday night meal could be stored as a simple array.
</li>
</ul>
<pre class="example">
Battered Cod
Chips
Peas
</pre>
<ul class="org-ul">
<li>In JavaScript this array would look like this.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">wednesday = [Battered Cod, Chips, Peas]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Learn It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Now imagine we needed to store several meals. For this we would need a 2d array. This is basically a list containing lists.
</li>
</ul>
<pre class="example">
Monday
    Pasta
    Bolognese
    Parmesan
Tuesday
    Beef Stew
    Mashed Potato
    Green Beans
Wednesday
    Battered Cod
    Chips
    Peas
</pre>
<ul class="org-ul">
<li>In JavaScript we would write this as so.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">meals = [[Pasta,Bolognese,Parmesan]
	 [Beef Stew, Mashed Potato, Green Beans]
	 [Battered Code, Chips, Peas]]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Learn It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>FruitBots uses a 2d array to store the positions of all the fruit on the board.
</li>
<li>Look at the board for game 1 that we have been using.
</li>
<li>If we wanted to store the positions of fruit for the first <b>column</b>, we could use an array like this - <b>[Cherry, Melon, Nothing, Nothing, Nothing, Nothing]</b>
</li>
<li>The second column would need another array - <b>[Melon, Nothing, Nothing, Nothing, Nothing, Melon]</b>
</li>
<li>The third column would need another array - <b>[Melon., Nothing, Banana, Melon, Nothing, Nothing]</b>
</li>
<li>This would continue and we would end up with 7 arrays.
</li>
<li>We can then store each of these 7 arrays in a 2d array.
</li>
<li>Of course it is not very efficient to store fruit types using strings, so numbers are used instead.
</li>
<li>0 = Empty, 1 = Apple, 2 = Banana, 3 = Cherry, 4 = Melon
</li>
<li>The entire array for the first board can therefore be described as follows.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">[[3,4,0,0,0,0] //THIS IS THE FIRST COLUMN OF THE BOARD
 [4,0,0,0,0,4] //THIS IS THE SECOND COLUMN OF THE BOARD
 [4,0,2,4,0,0]
 [0,0,4,2,0,0]
 [0,1,4,0,2,0]
 [3,0,0,0,0,3]
 [3,3,0,0,0,0]]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 document">
<h3 id="sec-1-5">Document It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Write your own explanation for what we mean by the term 2d array.
</li>
<li>Use a real life example that is different to the <i>meals</i> analogy used above.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 save">
<h3 id="sec-1-6">Save It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>We'll use the bot you made last lesson, for this.
</li>
<li>Open up mybot.js and then <i>SAVE IT AS</i> Lesson2bot.js
</li>
<li>That's the copy saved. Now close Lesson2bot.js and reopen mybot.js
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 code">
<h3 id="sec-1-7">Code It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>We need to get our bot to pick up fruit as it moves about the board.
</li>
<li>First we'll need to get the board's 2d array and store it.
</li>
<li>Add the code to your <code>make_move()</code> function that you wrote last lesson.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">function make_move(){
    //get the board's 2d array
    board = get_board()

    //store the player's x and y position in variables for clearer code.
    var my_x = get_my_x()
    var my_y = get_my_y()

    if(my_x &lt; target_x){
	return EAST
    }
    else if(my_x &gt; target_x){
	return WEST
    }
    else if(my_y &lt; target_y){
	return SOUTH
    }
    else if(my_y &gt; target_y){
	return NORTH
    }
    else{
	return PASS
    }
}
</pre>
</div>
<ul class="org-ul">
<li>We can access the fruit at any coordinate on the board using the following syntax - <code>board[x][y]</code>
</li>
<li>This will give us the <i>yth</i> value in the <i>xth</i> array.
</li>
<li>So board[3][5] would give you the 3rd fruit in the 5th array. Or in other words the fruit at x = 5 and y = 3.
</li>
<li>Therefore <code>board[my_x][my_y]</code> will give the fruit at your bot's current position.
</li>
<li>If the value is greater than 0, we should <code>TAKE</code> the fruit.
</li>
<li><b>MAKE SURE YOU UNDERSTAND THIS. IF IT CONFUSES YOU THEN ASK A PEER OR YOUR TEACHER FOR HELP</b>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">function make_move(){
    //get the board's 2d array
    board = get_board()

    //store the player's x and y position in variables for clearer code.
    var my_x = get_my_x()
    var my_y = get_my_y()

    //if there's a fruit at the bot's position then TAKE it.
    if(board[my_x][my_y] &gt; 0){
	return TAKE
    }

    //no fruit so let's move the bot towards the target
    else if(my_x &lt; target_x){
	return EAST
    }
    else if(my_x &gt; target_x){
	return WEST
    }
    else if(my_y &lt; target_y){
	return SOUTH
    }
    else if(my_y &gt; target_y){
	return NORTH
    }
    else{
	return PASS
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 run">
<h3 id="sec-1-8">Run It</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Run game.hmtl
</li>
<li>Try changing your bot's target<sub>x</sub> and target<sub>y</sub> so that it picks up as many fruit as possible
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2"><span class="section-number-2">2</span> Picking up all the Fruit (in theory)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3 learn">
<h3 id="sec-2-1">Learn It</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Sometimes it is handy to think of algorithms to solve our problems without actually writing any code. This is just a step by step set of instructions to solve a problem, and can be written in normal English.
</li>
<li>For instance, an algorithm to collect every fruit on the board could look something like this
</li>
</ul>
<pre class="example">
REPEAT THE FOLLOWING EACH MOVE
1. PICK A RANDOM NUMBER BETWEEN 1 and 4
2. IF NUMBER IS 1 THEN MOVE NORTH, IF IT IS 2 THEN MOVE SOUTH, IF IT IS 3 THEN MOVE EAST, IF IT IS 4 THEN MOVE WEST.
3. IF THERE IS A FRUIT ON THE SQUARE THEN TAKE IT
</pre>
<ul class="org-ul">
<li>You can try out this algorithm using the following code.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">function make_move() {
   var board = get_board();

   // Lovely, I've found a fruit.
   if (board[get_my_x()][get_my_y()] &gt; 0) {
       return TAKE;
   }
   // No fruit here so let's pick a direction to go in.
   // Make sure that you don't write Maths.random()
   var rand = Math.random() * 4;

   if (rand &lt; 1) return NORTH;
   if (rand &lt; 2) return SOUTH;
   if (rand &lt; 3) return EAST;
   if (rand &lt; 4) return WEST;

   return PASS;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3 badge">
<h3 id="sec-2-2">Badge It</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Try and come up with your own algorithm to take all the fruit on the board.
</li>
<li>You can work with a partner or on your own.
</li>
<li>Try to think of the most efficient way of getting to every square on the board, or maybe even just the squares that have fruit on them
</li>
<li>When you have finished your algorithm, show it to your teacher to get your badge.
</li>
<li>If you have time, you can try and code your algorithm.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
